//Задача 1. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом. 14212 -> нет 12821 -> да
/*
Console.Write("Input the number: ");
string. number = Console.ReadLine();
{
    if (number[0]==number[4] || number[1]==number[3])
    {
        Console.WriteLine("$it is a palindrome");
    }
    else 
    {
      Console.WriteLine("$ it is not palindrome");  
    }
}
int RandomNumber = new Random().Next(10000,100000);
// int RandomNumber = new Random().Next(10000,100000);
//Задача 2. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве. A (3,6,8); B (2,1,-7), -> 15.84. A (7,-5, 0); B (1,-1,9) -> 11.53



//Задача 3. Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N. 3 -> 1, 8, 27
/*
void CubeNumbers(int num)
{
    int current = 1;
    while (current <= num)
    {
        Console.WriteLine($"cube number of {current} = {current*current*current}");
        current++;
    }
}

Console.WriteLine("Input number ");
int num = Convert.ToInt32(Console.ReadLine());
CubeNumbers(num);
*/